import React from "react";
import AboutHeader from "../../Images/4.jpg";
import AboutImg from "../../Images/home_about.jpg";
import styles from "./about.module.css";

const About = () => {
  return (
    <>
      <div className={styles.About_header}>
        <div>
          <img src={AboutHeader} alt="" />
        </div>
      </div>

      <div className={styles.About}>
        <div className={styles.row}>
          <div className={styles.colsm5}>
            <img src={AboutImg} className={styles.imgfluid} alt="" />
          </div>

          <div className={styles.colsm6}>
            <h6>הנגשת פרוייקטים לילדים מוכשרים</h6>
            <h5>אנחנו תמיד איתך...</h5>
            <p>
              ברוכים הבאים לקורסי הטכנולוגיה שלנו לילדים! בעולם-טק, אנו מחויבים לטפח את הסקרנות והיצירתיות של מוחות צעירים באמצעות תוכניות טכנולוגיה מרתקות וחינוכיות. המשימה שלנו היא להעצים ילדים עם הכישורים הדרושים להם כדי לשגשג בעולם דיגיטלי, ולהכין אותם להפוך לחדשנים ולמנהיגים של המחר.
              <br />
              <br />
              החזון שלנו
              <br />
              אנו מאמינים שלכל ילד יש את הפוטנציאל ליצור, לחדש ולהוביל. על ידי מתן סביבת למידה מהנה ותומכת, אנו שואפים להצית תשוקה לטכנולוגיה בתלמידים שלנו. החזון שלנו הוא לתת השראה לדור הבא של פותרי בעיות טכנולוגיות שמוכנים להתמודד עם אתגרי העתיד.
              <br />
              <br />
              הקורסים שלנו
              <br />
              אנו מציעים מגוון רחב של קורסים המותאמים לקבוצות גיל ותחומי עניין שונים, כולל:
              <ul>
                <li>מבוא לתכנות: שיעורים מהנים ואינטראקטיביים המלמדים את יסודות הקידוד.</li>
                <li>רובוטיקה: פרויקטים מעשיים שבהם ילדים בונים ומתכנתים את הרובוטים שלהם.</li>
                <li>עיצוב ואנימציה דיגיטלית: מפגשים יצירתיים החוקרים את עולם האמנות והאנימציה הדיגיטלית.</li>
                <li>בניית אתרים: מדריכים שלב אחר שלב ליצירת אתרים אישיים באמצעות HTML ו-CSS.</li>
                <li>מציאות מדומה ורבודה: מבוא ליצירת חוויות VR ו-AR סוחפות.</li>
                <li>אלקטרוניקה: פרויקטים פשוטים ומרגשים המלמדים את יסודות האלקטרוניקה.</li>
                <li>פיתוח משחקים: למד את ההיגיון והכישורים הדרושים כדי לפתח משחקי וידאו משלך.</li>
                <li>בטיחות באינטרנט: טיפים ונהלים חיוניים להתנהגות מקוונת בטוחה ואחראית.</li>
                <li>בינה מלאכותית: מושגים ויישומים בסיסיים של AI בפרויקטים מהנים וקלים להבנה.</li>
                <li>פיתוח אפליקציות לנייד: עצב ופתח אפליקציות מובייל משלך.</li>
              </ul>
              <br />
              גישתנו
              <br />
              גישת ההוראה שלנו נועדה להפוך את הלמידה למהנה ונגישה לכל הילדים. אנו משתמשים בשילוב של שיעורים אינטראקטיביים, פרויקטים מעשיים ופעילויות שיתופיות כדי להבטיח שכל ילד יוכל ללמוד בקצב שלו ובסגנון שלו. המדריכים המנוסים שלנו נלהבים מטכנולוגיה וחינוך, והם מחויבים לספק סביבת למידה תומכת ומעוררת השראה.
              <br />
              <br />
              מדוע לבחור בנו?
              <br />
              תכנית לימודים מרתקת: הקורסים שלנו נועדו להיות מהנים ואינטראקטיביים, מה שהופך את הלמידה לשמחה.
              מדריכים מומחים: צוות המחנכים המיומנים שלנו מוקדש לעזור לכל ילד להצליח.
              למידה מעשית: אנו מאמינים בלמידה מתוך עשייה, עם הרבה פרויקטים ופעילויות מעשיות.
              סביבה בטוחה: אנו נותנים עדיפות לבטיחות ולרווחתם של התלמידים שלנו, הן מקוונות והן לא מקוונות.
              מיומנויות מוכנות לעתיד: התוכניות שלנו מציידות את הילדים במיומנויות הדרושים להם להצלחה עתידית בעולם דיגיטלי.
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default About;
